Autodesk.Revit.DB.Structure.RebarHookTypeSet
A set that contains RebarHook types.

Autodesk.Revit.DB.Structure.RebarHookTypeSet.Insert(Autodesk.Revit.DB.Structure.RebarHookType)
System.Int32
Insert the specified RebarHook type into the set.
item: The RebarHook type to be inserted into the set.
Returns: Returns whether the RebarHook type was inserted into the set.

Autodesk.Revit.DB.Structure.RebarHookTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarHookTypeSet.ReverseIterator
Autodesk.Revit.DB.Structure.RebarHookTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarHookTypeSet.ForwardIterator
Autodesk.Revit.DB.Structure.RebarHookTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.RebarHookTypeSet.Erase(Autodesk.Revit.DB.Structure.RebarHookType)
System.Int32
Removes a specified RebarHook type from the set.
item: The RebarHook type to be erased.
Returns: The number of RebarHook types that were erased from the set.

Autodesk.Revit.DB.Structure.RebarHookTypeSet.Contains(Autodesk.Revit.DB.Structure.RebarHookType)
System.Boolean
Tests for the existence of a RebarHook type within the set.
item: The RebarHook type to be searched for.
Returns: The Contains method returns True if the RebarHook type is within the set, otherwise False.

Autodesk.Revit.DB.Structure.RebarHookTypeSet.Clear
void
Removes every RebarHook type from the set, rendering it empty.

Autodesk.Revit.DB.Structure.RebarHookTypeSet.Size
System.Int32
get
Returns the number of RebarHook types that are in the set.

Autodesk.Revit.DB.Structure.RebarHookTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.